---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor(Autodesk.Revit.DB.PointCloudColorMode)
source: html/8360a01b-5361-8ca2-f2fb-397e7887cf92.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor Method

Constructs color settings object with default color for given color mode.

## Syntax (C#)
```csharp
public PointCloudColorSettings(
	PointCloudColorMode mode
)
```

## Parameters
- **mode** (`Autodesk.Revit.DB.PointCloudColorMode`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration